# Try и Except

def add_everything_up(a, b):
    """
    Складывает числа (int, float) и строки (str).
    Если a и b разные типы (число и строка), возвращает строковое представление этих двух данных вместе.

    Args:
        a: Первый аргумент, может быть int, float или str.
        b: Второй аргумент, может быть int, float или str.

    Returns:
        Результат операции сложения или строковое представление a и b.
    """
    try:
        # Попытка сложить a и b как числа
        return a + b
    except TypeError:
        # Если возникает TypeError, значит a и b разные типы (число и строка)
        # Возвращаем строковое представление a и b
        return str(a) + str(b)


# Примеры использования
print(add_everything_up(123.456, 'строка'))  # 123.456строка
print(add_everything_up('яблоко', 4215))  # яблоко4215
print(add_everything_up(123.456, 7))  # 130.456